[
  {
    "Timestamp": "4/21/2025 9:18:47",
    "What is your Uni": "ad3921",
  "Year": "Full Time",
    "Include this response?": "yes",
    "Career Filter": "Engineering/Tech",
    "Major Filter": "Engineering/Math || Humanities",
    "What is your Major(s) and Minor(s)?": "Mechanical Engineering, English",
    "Post Grad Plans": "FemCare R&D Associate Scientist/Engineer: Procter and Gamble",
    "Previous experiences and career path": "Climate news reporting, MechE women’s health research, high school mentorship, R&D engineering internship in FemCare",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "Given myself more grace to explore non-engineering options",
    "Skills to focus on": "Soft skills!! Anyone with a good attitude and time management skills will be successful",
    "Hacks and shortcuts": "Apply for things early as possible and show you are a real person",
    "Networking strategies": "Mainly created a broad network on Linkedin and reached out there",
    "Additional advice": "Apply to anything and everything please don't just limit yourself to big name commpanies"
  },
  {
    "Timestamp": "4/21/2025 9:28:44",
    "What is your Uni": "rjw2165",
  "Year": "Full Time",
    "Include this response?": "maybe",
    "Career Filter": "Media/Arts/Museums",
    "Major Filter": "Humanities || Arts/Media",
    "What is your Major(s) and Minor(s)?": "Art History (major)",
    "Post Grad Plans": "Archival Registration at Met Museum",
    "Previous experiences and career path": "I was in several theater productions at Columbia my freshman and sophomore year, but auditioning for and actually doing them became way too much of a time commitment with too little benefit to my career path. I focused more on being an illustrator for Spec, which I've used to beef up my marketing/communications/design skills. I interned for two archives, one over the summer and one for a full school year, both of which I got paid for through the Beyond Barnard Internship Program (cannot plug enough). Breaking into museum internships can be really hard-- don't let anyone tell you otherwise-- and I got my first one senior spring, but it has been the most useful for my career growth so far.",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "#1 Ask people who majored in what you are studying about their jobs. Really think hard about the career you can create from your major, how hard it is to break into certain industries, and how much you would click with different positions available. Think about the rhythm of life you want-- do you want to grind super hard in your twenties? Do you want a corporate 9-5 routine? Do you want something creative and spontaneous? Do you want to move around a lot? Are you okay with doing contract work or shorter-term jobs with less benefits and/or security?\n#2 Get the info for #1 by connecting with Barnard and Columbia upperclassmen and alumni on LinkedIn/career center and on campus! Be brave and ask for things! It seems scary, but imagine if someone from your high school wanted to ask you about your college-- you'd jump up to help. Suss out the vibes of different industries and positions in these conversations; ask about companies/institutions to apply to, places with projects alumni think might interest you, and which places are doing the next big thing. For humanities especially, also attend talks and events on campus and at nearby universities, and introduce yourself to people and meet scholars or industry professionals whose work interests you. Email them after the event and ask to meet and chat.",
    "Skills to focus on": "For Museum work, professional communication skills are #1. Tbh most people who work in museums are bit unpleasant, so being friendly-- and professional-- gets you FAR.\nFor library/archive/collections-focused art world work, getting an internship where you can use the software and hands-on registration systems is key. Primarily TMS is the most important, but getting a variety of software exposure beefs up your applications.",
    "Hacks and shortcuts": "#1 hack is take the time to write good cover letters. Super important for the humanities. It's a hot take but DO NOT USE AI for cover letters-- they're dry, un-engaging, and don't show off any of your writing skills.\n#2 is to apply to places that have had Columbia/Barnard interns recently. Reach out to the recent intern to ask them about their experience when you apply, and then reference chatting to that intern in an interview or even your cover letter.\n#3 is to build relationships with your academic advisor and professors. It's not much emphasized at this institution, but building those relationships (going to office hours, taking their classes and really engaging, emailing with them, asking about their work and upcoming lectures or projects, etc. you could attend) gets you good letters of recommendation and good advice in the long run.\n#4 is to USE THE CAREER CENTER. I have less experience with Columbia's but Beyond Barnard is an amazing resource, even if it can seem scary at times. Have them look over your application materials, do practice interviews, chat about strategies to find jobs, etc. And, send your application materials to connections you've made in the industry as well to get second opinions!",
    "Networking strategies": "Reaching out on LinkedIn to art history/museum professionals to ask for a chat works great in my experience. Definitely talk to lower-level people before you ask a more senior person for a conversation, so you know a bit more going in, but don't be afraid to reach out to anyone and everyone. Ask them to be put in any groups for young professionals, identity-based groups for people in your field (especially because marginalized groups, esp. BIPOC, are so underrepresented in the arts: find people who know what it's like to be someone like YOU trying to make it in the art world), to be put in touch with recruiters, etc.",
    "Additional advice": "#1-- Don't let your success in the job market affect your self-esteem. The rules of how things are done, especially in the art world, are arbitrarily set by people trying to make the most money possible. Navigating these rules is important but tripping up does not make you a failure-- it makes you human. And secretly everyone wants candidates with more humanity!\n#2-- write a year-long senior thesis. Especially if you have less internships under your belt, this will give you experience in research, communication, writing, presenting, and shifting course with critique. And it will give you something to talk about in interviews!\n#3-- if you're looking for art jobs and struggling with finding something in New York, look elsewhere. Especially for smaller museums and more rural areas-- if you can get housing to intern there, or do it virtually, these organizations have smaller applicant pools and smaller teams that will teach you more, focus on you more, and help you more in the long run."
  },
  {
    "Timestamp": "4/21/2025 9:38:51",
    "What is your Uni": "adf2164",
  "Year": "Full Time",
    "Include this response?": "yes",
    "Career Filter": "Engineering/Tech || Academia/Graduate School || Sustainability/Environment",
    "Major Filter": "Engineering/Math",
    "What is your Major(s) and Minor(s)?": "EEE",
    "Post Grad Plans": "Electrical Engineering",
    "Previous experiences and career path": "Research in a lab at the university of south Alabama then research in the Yip Lab at Columbia.",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "Learn more about what research actually is",
    "Skills to focus on": "Get better at reading scientific papers and learning about methods.",
    "Hacks and shortcuts": "Seeking as much advice from older mentors as possible.",
    "Networking strategies": "Getting on calls and asking questions to potential future research mentors.",
    "Additional advice": "Make sure you surround yourself with people who can distract you from work and make you laugh."
  },
  {
    "Timestamp": "4/21/2025 9:40:55",
    "What is your Uni": "mrh2189",
  "Year": "Full Time",
    "Include this response?": "yes",
    "Career Filter": "Business/Finance || Engineering/Tech || Sustainability/Environment",
    "Major Filter": "Engineering/Math || Social Sciences",
    "What is your Major(s) and Minor(s)?": "Chemical Engineering major and Political Science minor",
    "Post Grad Plans": "Compliance specialist at Ecoengineers a Environmental Consulting Firm",
    "Previous experiences and career path": "Freshman internship: Fleet Intern at public transit form ; Sophomore internship: sustainability analyst at Boeing; Junior internship: renewable intern at mid American. Clubs: CU barbell, CU Dems, Resident Advisor, CU sustainable energy",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "I would have selected the major I wanted as opposed to letting outside opinions away me. Environmental Engineering would have been more applicable and easier, but outside pressures detected me",
    "Skills to focus on": "Small talk is an underrated career skil",
    "Hacks and shortcuts": "always write a cover letter",
    "Networking strategies": "expand net as wide as you can",
    "Additional advice": ""
  },
  {
    "Timestamp": "4/21/2025 9:43:40",
    "What is your Uni": "aa4869",
  "Year": "Full Time",
    "Include this response?": "yes",
    "Career Filter": "Engineering/Tech",
    "Major Filter": "Engineering/Math",
    "What is your Major(s) and Minor(s)?": "Math-Computer Science",
    "Post Grad Plans": "Data Science Master's at Cambridge",
    "Previous experiences and career path": "Participated in Google’s Software Product Sprint program after freshman year. Interned as a Software Engineer at Bank of America after sophomore year. Conducted biomedical research at Columbia University after junior year.",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "I didn’t have a clear career plan at first, so I followed whatever seemed interesting. I explored different classes, side projects, and opportunities without worrying too much about the outcome. Over time, those experiences added up and helped me get into the Data Science master’s program at Cambridge. You don’t need to have everything figured out from the beginning. Just stay curious and keep trying new things.",
    "Skills to focus on": "python, as well as machine learning projects",
    "Hacks and shortcuts": "Taking advantage of early-access programs and proactively reaching out to professors gave me a strong head start. Those conversations often led to valuable opportunities and mentorship.",
    "Networking strategies": "",
    "Additional advice": "have fun, go abroad, dont leave any hard classes for senior spring :)"
  },
  {
    "Timestamp": "4/21/2025 9:46:02",
    "What is your Uni": "aa4868",
  "Year": "Full Time",
    "Include this response?": "yes",
    "Career Filter": "Business/Finance || Engineering/Tech",
    "Major Filter": "Engineering/Math",
    "What is your Major(s) and Minor(s)?": "Electrical Engineering, Computer Science",
    "Post Grad Plans": "Software Engineer at Banking Institution",
    "Previous experiences and career path": "Internships every summer and jobs during schoolyear",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "",
    "Skills to focus on": "Have technical projects, it helps build intuition and skills.",
    "Hacks and shortcuts": "Building strong networks through genuine conversations and social confidence helped me open doors and stand out. Relationships often matter just as much as resumes.",
    "Networking strategies": "Be genuine instead of transactional, everyone can smell a transactional person from a mile away",
    "Additional advice": "Be passionate and find what you enjoy doing. It is okay to not know what your full career will look like, thats the fun of it all!"
  },
  {
    "Timestamp": "4/21/2025 9:46:47",
    "What is your Uni": "as6482",
  "Year": "Full Time",
    "Include this response?": "yes",
    "Career Filter": "Engineering/Tech || Academia/Graduate School",
    "Major Filter": "Engineering/Math || Social Sciences",
    "What is your Major(s) and Minor(s)?": "Environmental Engineering with a minor in Sociology",
    "Post Grad Plans": "A graduate engineer with Equinor",
    "Previous experiences and career path": "Did research with Yip’s lab freshman year, summer internship sophomore year at CDM Smith, summer internship junior year at Ocean Winds, and recruited for Equinor senior fall",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "I would have worked on forming meaningful connections with my professors. Go to office hours!! It’s so important",
    "Skills to focus on": "Definitely focus on understanding the intersection between policy and engineering. It will set you up to be different from the mainly technical people.",
    "Hacks and shortcuts": "Not nescasarily a hack but be extremely curios",
    "Networking strategies": "Try to find a hobby or something in common with the person you are talking to. From there, you can transition to a more professional conversation.",
    "Additional advice": "Explore fields outside of your own and take classes that interest because you might discover something you love."
  },
  {
    "Timestamp": "4/21/2025 9:59:32",
    "What is your Uni": "jrt2170",
  "Year": "Full Time",
    "Include this response?": "yes",
    "Career Filter": "Engineering/Tech",
    "Major Filter": "Engineering/Math",
    "What is your Major(s) and Minor(s)?": "Computer Science",
    "Post Grad Plans": "Software Engineer at Figma",
    "Previous experiences and career path": "Started with hobby programming, which led to internships, research projects, and organizing tech clubs.",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "",
    "Skills to focus on": "apply to jobs early, prepare early for everything",
    "Hacks and shortcuts": "",
    "Networking strategies": "",
    "Additional advice": ""
  },
  {
    "Timestamp": "4/21/2025 10:00:16",
    "What is your Uni": "ors2119",
  "Year": "Full Time",
    "Include this response?": "yes",
    "Career Filter": "Business/Finance || Academia/Graduate School || Media/Arts/Museums",
    "Major Filter": "Business/Finance || Engineering/Math",
    "What is your Major(s) and Minor(s)?": "Physics and Econ-math",
    "Post Grad Plans": "Finance PhD at Wharton",
    "Previous experiences and career path": "I did physics research for a while (including two summers), then transitioned to economics research (for a summer and a few semesters).",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "I would have thought more carefully about the coursework I wanted to do. Double majoring is hard, so being particularly precise about which coursework you need and which less so is important.",
    "Skills to focus on": "Getting good at coding is a must for both physics and Econ research. It makes you way more marketable than others.",
    "Hacks and shortcuts": "Getting into research early helped me publish early, which then helped me get into grad school. Research early also helps inform you if you actually want to do it, and if so, which field  you want to pursue.",
    "Networking strategies": "Talking with people who already do what you want to do at Columbia. People are very willing to help.",
    "Additional advice": "Your interests likely won’t follow a straight line. You might easily change majors. Getting good at the foundational technical skills is the best thing to do as opposed to general knowledge in a field (aka good math skills vs economics knowledge). Having transferable skills is a big plus if you’re changing career paths, and it might be advantageous because few people might have your particular transferable skills. The same can rarely be said for electives or topic specific knowledge."
  },
  {
    "Timestamp": "4/21/2025 10:03:53",
    "What is your Uni": "st3440",
  "Year": "Full Time",
    "Include this response?": "yes",
    "Career Filter": "Engineering/Tech || Academia/Graduate School || Education/Teaching",
    "Major Filter": "Science/Health Science || Engineering/Math",
    "What is your Major(s) and Minor(s)?": "Biomedical Engineering",
    "Post Grad Plans": "PhD in Cancer Engineering at Memorial Sloan Kettering's Gerstner Sloan Kettering School",
    "Previous experiences and career path": "Had a short summer research internship in a computational neuroscience lab at Tel Aviv University after my freshman year. Not exactly what I was interested in in the long term, but my first exposure to research and working on a project on my own. Sophomore year January I started in the Danino lab, researching using bacteria as a treatment for glioblastoma. I have stayed in this lab up until now, loving it and it has shaped my career path. Summer after junior year I worked in cancer immunotherapy research at Bristol Myers Squibb, also a formative experience in shaping my interest in immunology.",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "Take more time to read books about my field. A few books that I had read in my junior year really changed the way I thought about science.",
    "Skills to focus on": "Definitely invest time into projects like in research. Helps you narrow down what you're interested in and take ownership for your work.",
    "Hacks and shortcuts": "Cold emailed the Danino lab and got a position. Don't be afraid of cold emailing and reaching out to people who you're connected with.",
    "Networking strategies": "Again - cold emailing, cold messaging through Linkedin. It's not actually that deep and takes a bit of bravery to start doing, but can help you meet people you may be interested in. Also focus on friendship in your career circles. Friendship goes a long way and helps you connect with others.",
    "Additional advice": "Took me a while to get this, but I do some of my best work in the morning - don't be afraid to try new routines! Also make friends and do fun things. That is what college is all about."
  },
  {
    "Timestamp": "4/21/2025 10:09:44",
    "What is your Uni": "rs4241",
  "Year": "Full Time",
    "Include this response?": "yes",
    "Career Filter": "Academia/Graduate School",
    "Major Filter": "Science/Health Science || Engineering/Math",
    "What is your Major(s) and Minor(s)?": "Biomedical Engineering",
    "Post Grad Plans": "MS/PhD at Columbia University as an NSF GRFP Fellow",
    "Previous experiences and career path": "I've done research fellowships during my 4 years at columbia! i also work at a few non profits",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "Explored various research positions/fields to see if there is one that i am\"in love\" with. i stuck with my lab at columbia for a while and didnt get to try new things",
    "Skills to focus on": "data analysis, scientific communication, laboratory techniques",
    "Hacks and shortcuts": "Having two mentors who were willing to talk me through challenges made a huge difference",
    "Networking strategies": "I talked to professionals/students in a bunch of fields to see whats right for me (ie industry, medical school, grad school) and now have a mentor in each field!",
    "Additional advice": ""
  },
  {
    "Timestamp": "4/21/2025 11:09:18",
    "What is your Uni": "TJE2119",
  "Year": "Full Time",
    "Include this response?": "continue fixing",
    "Career Filter": "Academia/Graduate School || Media/Arts/Museums",
    "Major Filter": "Social Sciences",
    "What is your Major(s) and Minor(s)?": "Political Science",
    "Post Grad Plans": "After graduation, I’ll be working in communications at the Aspen Institute’s Center for Native American Youth, writing speeches for Deb Haaland’s gubernatorial campaign, and appearing on PBS’s Roadtrip Nation. I’m also starting my MFA in Creative Writing at American University in Washington, D.C. this fall.",
    "Previous experiences and career path": "I started out at Columbia University trying to meet as many people as possible. I started Columbia’s first sex column with the Columbia Daily Spectator and even joined the rugby team. \n\nHowever, I grew up with a love for politics and knew I wanted to pursue advocacy work. I joined the Indigenous Peoples’ Initiative my freshman year and worked tirelessly with every federally recognized Tribal Nation and even the White House on uplifting Tribal youth.\n\nDuring my junior year, I interned with a law firm — LPHS — over the summer which gave me the indication that I wanted to be an attorney. I then studied abroad during my junior year at the London School of Economics and Political Science (LSE) where I gained recognition as a writer for Osage News and Cosmopolitan UK. \n\nNow, as I’m working in Indigenous youth advocacy in D.C. as well as pursuing my career of being a writer, I know I wanted to continue telling stories that uplift my community.",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "I would meet with leaders or mentors across any field and ask for ADVICE. Just by being curious and open about your path, you’ll never know who will open a door for you that you never knew existed.",
    "Skills to focus on": "-Learn how to talk to anyone for everyone\n-Public Speaking\n-Take a Writing Class for FUN …. Then, learn how to market and tell your own unique story\n-Develop your network with 1-on-1 meetings\n-Go to as many events as possible",
    "Hacks and shortcuts": "Timing is everything — learn how to ride certain waves or keep an audience.",
    "Networking strategies": "If I’m looking for an opportunity, go to a company’s page on LinkedIn and reach out to every alumni who works there as possible.\n\nIn fact, set aside 1 hour a week to solely grow your network and ask for meetings.\n\nAlso, go to as many events as possible—even alone! You’ll never who you’ll meet.",
    "Additional advice": "The biggest lesson I’ve learned in my undergraduate is how to not only pick myself up after surviving the worst thing to ever happen to me, but learning the power of saying no.\n\nYou pick and choose each path in your life— stay true to what the younger version of you would be proud of today and get that bag mama."
  },
  {
    "Timestamp": "4/21/2025 11:25:48",
    "What is your Uni": "hcf2115",
  "Year": "Full Time",
    "Include this response?": "yes",
    "Career Filter": "Engineering/Tech || Healthcare/Life Sciences",
    "Major Filter": "Engineering/Math || H",
    "What is your Major(s) and Minor(s)?": "Operations Research",
    "Post Grad Plans": "Project Manager at Epic Systems, specializing in healthcare technology and systems implementation.",
    "Previous experiences and career path": "Freshman year i focused on advocacy and getting involved with GendeRev and Men’s lacrosse, along with getting a job and promotion at Dodge Fitness Center. I worked bartending and traffic flagging that summer. My sophomore year, I joined NSOP as an OL, and I was very involved with GendeRev, planning and executing GenderF*ck, along with continuing my work with men’s lacrosse and at Dodge. That summer, I spent working as a camp counselor and leading backpacking trips through Colorado and New Mexico. Junior year I returned to NSOP as a Crew Captain, and I joined a choir group, continued at Dodge and with men’s lacrosse, and served as an RA in East Campus. That summer, i worked as the program coordinator for NSOP’s Columbia Outdoor Orientation Program (COÖP). This year (my senior year) I have continued with Men’s lacrosse, joining the exec board as the safety officer. I also continue to serve in my role as building manager at Dodge Fitness Center, along with serving as a RHLO Rep for EC’s Hall Council. I have also served as the team manager of the Varsity Women’s lacrosse team this year. Overall my focus and experience is in organizing others and facilitating events for the broader community.",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "Nothing. I explored my interests and my talents, and i think that is one of the most important things to do in college. You are exactly where you’re meant to be.",
    "Skills to focus on": "Collaborating with others and being a good listener. More importantly, i think it’s important to be able to lead from the sidelines, encouraging others to share their ideas, chase their ambitions, and have a collaborative environment. Team work is invaluable in any industry.",
    "Hacks and shortcuts": "Use the connections you currently have to get where you want to be. Don’t be afraid to introduce yourself and talk about your interests and experience. More often than not, people who can open doors for you, want to be the person that helped someone achieve their goals.",
    "Networking strategies": "Talk to your classmates, form relationships in your clubs and extracurriculars, find people in your major that you can study and do homework with.",
    "Additional advice": "Take care of yourself first. You cannot put your best foot forward if your basic needs are not taken care of (sleep! hydrate! eat! decompress!)"
  },
  {
    "Timestamp": "4/21/2025 11:40:48",
    "What is your Uni": "mab2459",
  "Year": "Full Time",
    "Include this response?": "yes",
    "Career Filter": "Business/Finance || Engineering/Tech",
    "Major Filter": "Engineering/Math",
    "What is your Major(s) and Minor(s)?": "Computer Science",
    "Post Grad Plans": "Trading at JP Morgan",
    "Previous experiences and career path": "Sophomore Summer - Worked at Cruise, a self-driving car company in San Francisco doing engineering\nJunior Summer - JPMorganChase, Global Finance & Business Management",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "Not much! All I would have done is stay up-to-date on things going on in the world. Whether it be the markets or new tech advancements. We are given Financial Times, Wall Street Journal, and New York Times subscriptions, USE THEM AS MUCH AS POSSIBLE. Staying current on current events is such an important part of interviewing and growing your knowledge base.",
    "Skills to focus on": "This may sound cliche but showing your interests through personal projects looks great and is also a cool experience for you.",
    "Hacks and shortcuts": "Talk to as many alumni as possible.",
    "Networking strategies": "Emailing a contact after calling / coffee chatting them is awesome. Keeping a connection with someone will reap benefits later on.",
    "Additional advice": ""
  },
  {
    "Timestamp": "4/21/2025 12:13:14",
    "What is your Uni": "sjf2170",
  "Year": "Full Time",
    "Include this response?": "yes",
    "Career Filter": "Business/Finance || Engineering/Tech",
    "Major Filter": "Engineering/Math",
    "What is your Major(s) and Minor(s)?": "Applied Math and  Astronomy",
    "Post Grad Plans": "Sales",
    "Previous experiences and career path": "Freshman year, I did a math modeling summer program with a Columbia math professor and joined Nightline.\nSophomore year, I joined the Columbia Bartending Agency, did a summer research experience in the solar physics lab where I modeled electromagnetic waves in python.\nJunior year, I worked as an Orientation Leader, and otherwise stayed at home to spend time with family.\nSenior year, I joined Global Research Consulting and worked on a couple game-related projects in python.",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "Tried to break into industry sooner.  I had planned to get a PhD after graduation, but I realized after my sophomore year that I had little interest in research.",
    "Skills to focus on": "",
    "Hacks and shortcuts": "I have not seen professional progress.",
    "Networking strategies": "Reaching out over linkedin to columbia alumni",
    "Additional advice": ""
  },
  {
    "Timestamp": "4/21/2025 12:19:42",
    "What is your Uni": "rr3430",
  "Year": "Full Time",
    "Include this response?": "yes",
    "Career Filter": "Academia/Graduate School || Government/Policy/Legal || Education/Teaching",
    "Major Filter": "Social Sciences",
    "What is your Major(s) and Minor(s)?": "Political Science major and Education Studies concentration",
    "Post Grad Plans": "Teaching at a New York public school and pursuing graduate studies in policy at Hunter College.",
    "Previous experiences and career path": "Clubs: Played club soccer for all 4 years and ascended in leadership throughout the years -- served as interim coach last season. Served as a member and research fellow for the Education Center in the Columbia Policy Institute. Chair of the Advocacy Committee in the Criminal Justice Coalition. \nWork: Interned with Project Rousseau as a Migrant Crisis Response intern where I supported families seeking asylum relief and students applying to college. Fellowship with Uaspire, a national education nonprofit focused on college access for FGLI students, got to do policy advocacy on local, state, and national levels. Served as a Legal Intern at a local law office during 2 separate summers where I worked on municipal and superior court criminal defense cases and provided administrative support to the office.\nWorked in an educational setting in some capacity all 4 years. Served as a teaching assistant for an elementary school classroom in Harlem for 6 months, as a college mentor for students from Project Rousseau, English teacher for babies and children, and current bilingual tutor at a high school in Brooklyn.",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "Be involved in more clubs that were interesting to me, such as student newspaper. Write and publish your written work. Connect more with professors.",
    "Skills to focus on": "Manage your time in a planner or calendar. Don't bite off more than you can chew because you want to say you're doing so many cool things. Commit to a few things you really care about and give your all there, you can't be in too many places at once. Connect with your professors they want to hear from you. Be genuine and not transactional, people can tell when you just want something out of them. Don't stop taking care of yourself physically mentally and emotionally, in whatever way that looks like for you. Say no to things you don't want to do.",
    "Hacks and shortcuts": "Networking. Keep up with LinkedIn, attend events, cold email people that you think are cool and ask to get involved. Be nice and curious about people's work.",
    "Networking strategies": "Networking, messaging people on LinkedIn. Ask to set up times to chat with people just to learn about their career trajectories and their current work.",
    "Additional advice": "I am happy to chat with anyone that wants to, I care a lot about student mentorship and know a lot of info that may be helpful for someone younger! My personal email is roselyn1815@gmail.com and you can reach out anytime!"
  },
  {
    "Timestamp": "4/21/2025 13:10:12",
    "What is your Uni": "Kjp2168",
    "Year": "Senior",
    "Include this response?": "yes(shitty)",
    "Career Filter": "Engineering/Tech || Healthcare/Life Sciences",
    "Major Filter": "Science/Health Science || Engineering/Math",
    "What is your Major(s) and Minor(s)?": "Biomedical Engineering",
    "Post Grad Plans": "Robotics Engineer at Stryker (med device)",
    "Previous experiences and career path": "Internships, clubs, research.",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "Apply for internships in the fall semester",
    "Skills to focus on": "Time management, framing yourself on a resume",
    "Hacks and shortcuts": "Creating a story for myself on my resume",
    "Networking strategies": "LinkedIn + cold emailing companies",
    "Additional advice": "Have confidence and believe in yourself!"
  },
  {
    "Timestamp": "4/21/2025 13:16:55",
    "What is your Uni": "pmh2134",
    "Year": "Senior",
    "Include this response?": "yes",
    "Career Filter": "Healthcare/Life Sciences",
    "Major Filter": "Social Sciences",
    "What is your Major(s) and Minor(s)?": "Human rights (major) & sustainable development (minor)",
    "Post Grad Plans": "Medical Device sales",
    "Previous experiences and career path": "-- internship @ Honeywell (a Fortune 100 tech & manufacturing company) 2 summers in a row (summer after sophomore year & summer after junior year); \nmy role was a sustainability/ESG (environment, social, governance) analyst. \n\n\n\nNotes:\nI got a return offer but realized after 2 summers that ESG/ the world of corporate sustainability was not very genuine & just greenwashed/not where real change was made; it made me want to leave the field of sustainability entirely and enter sales instead. I chose sales instead so I make more money and because I realized my strengths (being a people-person/super talkative) were being overlooked as I sat quietly in an office chair all day; i realized i needed a job that fit my strengths, so i started looking into sales.",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "I would have started doing internships earlier, even if small silly seeming opportunities... because the sooner you get into a field/ industry you get a better sense if its something you want to actually do. and you have time to change your mind  & try a new industry the following summer or fall,spring, etc.\n\nJUST KEEP TRYING NEW STUFF TO SEE WHAT YOU LIKE (if youre unsure about what you wanna do)",
    "Skills to focus on": "definitely technical skills for resume... and for interviewing and to make you appealing on PAPER to these companies.. thats how you get your foot in the door most the time if youre just flat out applying and not networking...\n\nHOWEVER.. never undermine the power of soft skills... like being a people-person & networking & being kind & funny.... the internships I secured were all purely because I networked and knew somebody who knew somebody who liked me and I did it completely on my own so you could too!!! You gotta put yourself out there & be different if you want to get a job; having a 4.0 & great accomplishments is cool but EVERYONE Has that too, so whats going to make you different?!",
    "Hacks and shortcuts": "I think cold calling and cold emailing is highly underrated.\nhowever, the efficacy of this depends on your field/industry sometimes. finance/tech might be harder, but still doable if you have the credentials. everything else is fair game.\n\nstill, the power of picking up the phone and calling the hiring manager, recruiter, etc and saying \"hey i want this job/ im interested in this job/ heres why im a good fit.\" GOES SUCH A LONG WAY & makes you stand out. \n\nalso cold emailing (if you dig to find it on their linkedin or internet). I landed a sophomore summer internship at a Fortune 100 company's headquarters because I emailed the vice president this long email saying i would love to work here because of the work your'e doing & if there are any opportunities even just to shadow pls let me know and she gave me an internship on the spot without an interview. she later asked me to work there full time.\nYou dont know if you dont ask!\n\njob searching as a senior i found that cold calling was how to land things. APPLYING on handshake. & regular job searching sites did nothing. i know 1% of friends from top schools around USA who heard back from those apps and made it to the next round. the rest of us, get denied or never hear back at all. dont waste your time, especially if youre in any arts field that isnt science or tech) just find people on linkedin at a company you would wanna work at and cold call them !!! you will find they are more interested than not if you got a decent resume!",
    "Networking strategies": "cold emailing & cold calling, being personable/funny/casual when talking to employers.\n\nbeing \"straightforward\" in the sense that you don't beat around the bush; when talking to a recruiter or a hiring manager  ask the tough questions the awkward questions, tell them you really want this and you would be the best. don't be afraid. you have nothing to lose. \nASK FOR JOBS by cold emailing! you'd be surprised how many people say yes.",
    "Additional advice": ""
  },
  {
    "Timestamp": "4/21/2025 13:45:21",
    "What is your Uni": "cjk2170",
    "Year": "Senior",
    "Include this response?": "yes",
    "Career Filter": "Engineering/Tech || Healthcare/Life Sciences || Sustainability/Environment",
    "Major Filter": "Business/Finance || Humanities",
    "What is your Major(s) and Minor(s)?": "German Literature & Cultural History. Concentration - Economics",
    "Post Grad Plans": "Project Manager at Epic Systems, a healthcare software company specializing in electronic health records (EHR). I’ll be leading implementations of Epic’s EHR systems at hospitals and clinics transitioning to the platform.",
    "Previous experiences and career path": "After freshman year: Worked at 2 restaurants in my hometown, had a (informal) remote consulting internship. After sophomore year: Worked at another hometown restaurant. After junior year I was studying abroad in Berlin, Germany. In school I've been involved in organizations like the Sigma Nu fraternity, Formula SAE, Sundial Magazine, as well as various leadership positions within Sigma Nu and the Senior Fund.",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "I'm happy with what I did. I would worry less about getting a prestigious internship after your freshman year, and (if possible) to enjoy summers at home where you can be with your family and hometown friends. In terms of career preparation, I would try to widen my interests as much as possible and gather information (through work experiences or simply online research) of what different career paths may look like so I could try to envision myself working in a given field.",
    "Skills to focus on": "Epic has a unique recruiting process--they focus less on networking and more on aptitude and a method of thinking. So there's nothing to really study for--you show up and take some aptitude tests. Of course, soft skills and being an impressionable person in interviews is always important, but you should try to be a well-rounded person before everything else. Someone who is smart, of course, but who can also work well with people is very important for Epic.",
    "Hacks and shortcuts": "Stay on top of things you can control--school, your mental state, how you interact with others. If you can do that, then you're giving yourself a head-start when you do start to recruit, because you won't have to worry about things that automatically disqualify you, such as grades, poor first impressions, etc.",
    "Networking strategies": "LinkedIn messaging works very well in my experience. Send a pointed message and ask for advice, because people are more likely to want to talk about themselves.",
    "Additional advice": "Stay present and enjoy the time that you have at Columbia, because it's truly a unique experience that very few people are afforded."
  },
  {
    "Timestamp": "4/21/2025 13:58:27",
    "What is your Uni": "mdw2166",
    "Year": "Senior",
    "Include this response?": "yes",
    "Career Filter": "Academia/Graduate School",
    "Major Filter": "Engineering/Math",
    "What is your Major(s) and Minor(s)?": "Mechanical Engineering and Astrophysics",
    "Post Grad Plans": "PhD in Astronomy, at Harvard University",
    "Previous experiences and career path": "Started in SEAS MechE, tried research over the summer and started contributing engineering work on astrophysics instrumentation, eventually transitioned to include science work as well. Heavily involved in campus engineering clubs all the way through, namely the Columbia Space Initiative, where I started a satellite team and led many public outreach events with astronauts and other aerospace professionals.",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "Nothing much. I explored a ton of extracurriculars, took classes that were interesting to me even when they didn't directly contribute to my mechanical engineering major, and these built some of my closest mentorships and helped me decide to commit to a new field (astronomy).",
    "Skills to focus on": "Breadth of current research and industry work, to help students understand what career paths actually look like, and connect class concepts to cutting-edge work. Also would help for students to understand what research is happening at Columbia that they might be able to get involved with. Most important thing is for students to have resources and time/space/encouragement to pursue independent projects and take leadership over technical work (be this in research or in building an engineering portfolio for industry).",
    "Hacks and shortcuts": "Building mentorships with key professors early, by taking their classes and looking for reasons to learn from them or seek out advice. For me, these were Professors Mike Massimino (mechE) and David Schiminovich (astro).",
    "Networking strategies": "Office hours. Reaching out to individuals as a representative of a club or group. Making honest/genuine connections at conferences. Reaching out to other groups/teams at other universities who are doing similar work (for me, this was other teams building student-led satellites)",
    "Additional advice": "Columbia classes do a very poor job at preparing students to get jobs in mechanical or aerospace engineering; there are not clear opportunities to build a strong portfolio of novel work."
  },
  {
    "Timestamp": "4/21/2025 14:18:18",
    "What is your Uni": "aag2204",
    "Year": "Senior",
    "Include this response?": "yes",
    "Career Filter": "Engineering/Tech || Academia/Graduate School",
    "Major Filter": "Engineering/Math",
    "What is your Major(s) and Minor(s)?": "Electrical Engineering , CS minor",
    "Post Grad Plans": "Pursuing graduate studies in Electrical Engineering at Columbia University, specializing in circuits and electronics.",
    "Previous experiences and career path": "Freshman summer: interned at Banner health doing AI software for medical imaging \nSophomore year: joined CSI rockets mission\nSophomore summer: interned at TGen doing applied math and machining learning software for genomics research\nJunior year: became more active with rockets at CSI\nJunior Summer: interned at BAE Systems as an engineering intern \nSenior year: subteam lead for rockets in CSI\nSenior summer: incoming engineering intern at Honeywell for circuit design",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "I wish I would have sought out more clubs and invested more effort in internship recruitment to develop skills that aren’t specially taught at Columbia (PCB design primarily)",
    "Skills to focus on": "Take classes in your career field earlier on and spread out basic engineering requirements across your 4 years instead of front loading basic requirements in your first two years and then doing majority of major specific courses later. \n\nGet involved in an engineering club earlier (your schedule is much lighter during your first couple years)",
    "Hacks and shortcuts": "Taking more challenging classes now during junior/senior year rather than postponing them to my masters helped a lot. Even if your grade isn’t the highest, the most important thing you will get out of the class is knowledge of the content and project experience, which is more important for companies.\n\nIf you are able, make a portfolio as early as possible with relevant projects (I found a lot more companies wanting to interview with me once I implemented this).",
    "Networking strategies": "Constant applications to as many companies as possible.",
    "Additional advice": ""
  },
  {
    "Timestamp": "4/21/2025 14:28:29",
    "What is your Uni": "eat2162",
    "Year": "Senior",
    "Include this response?": "yes",
    "Career Filter": "Academia/Graduate School",
    "Major Filter": "Science/Health Science || Engineering/Math",
    "What is your Major(s) and Minor(s)?": "Chemistry, Math",
    "Post Grad Plans": "PhD in Chemistry at Oxford",
    "Previous experiences and career path": "Freshman year - clubs (member and board), classes\nSophomore year - clubs (member, board, and founder), more classes of interest, research, volunteering, SURF fellowship\nJunior - more clubs, more specialized classes, research, SURF, conferences, independent, systematic review, volunteering\nSenior - less clubs, focus on research, national conference presentations, volunteering",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "Learn better ways to study from the beginning;",
    "Skills to focus on": "Join a lab early; spend all free time in lab; read papers",
    "Hacks and shortcuts": "Conferences, especially national ones not aimed towards undergraduates; forces me to act above my level and answer questions meant for those older than me; also gives opportunity to network",
    "Networking strategies": "Be very formal and respectful to people above you, especially in academia; have humility and willingness to accept your mistakes; Let people talk about themselves before you talk about you; Accept negative views on your work but do not let someone undermine you as a person",
    "Additional advice": "Sign up for all opportunities; if you get the positions/acceptance do it, I have been able to gain so many new experiences and connection from things I signed up for on whim but ended up loving it and gaining loads of new skills. The things I did not like and did like helped narrow done my career goals and academic aspirations."
  },
  {
    "Timestamp": "4/21/2025 15:06:13",
    "What is your Uni": "fac2140",
    "Year": "Senior",
    "Include this response?": "yes",
    "Career Filter": "Business/Finance || Engineering/Tech",
    "Major Filter": "Business/Finance || Social Sciences",
    "What is your Major(s) and Minor(s)?": "Major: Urban Studies Minor: Economics",
    "Post Grad Plans": "Data Privacy Analyst at Sage Bionetworks",
    "Previous experiences and career path": "Freshman year: SIPPS summer intern - assisted on psychology research; joined Club Bangla, Consilience Magazine (quit), Zamana (quit); started working as Student Associate at Office of Religious Life and ushered at Miller Theater\n\nSophomore year: Events chair for Club Bangla; joined Columbia Political Review and Columbia Pep Band; continued working at ORL; Research Assistant for Mailman School of Public Health; summer Data Privacy intern for Xenon Health\n\nJunior Year: VP of Club Bangla and Publicity Chair for CPR; Continued working at ORL; summer Risk & Regulatory internship at MFS Investment Management\n\nSenior Year: Publicity Chair for CPR; continue working at ORL; research assistant for Economics department",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "Decided on a major earlier and dove deep into it rather than questioning/constantly changing my own journey; stop comparing myself to others, especially non-FLI students; networked/cold-messaged more; tried self-motivated side projects",
    "Skills to focus on": "GIS/Rhino; R/Python",
    "Hacks and shortcuts": "Cold-messaging on LinkedIn after applying to a job",
    "Networking strategies": "",
    "Additional advice": "Stop questioning yourself; explore, but also pick a field that intrigues you and become the best in it"
  },
  {
    "Timestamp": "4/21/2025 17:31:01",
    "What is your Uni": "abk2187",
    "Year": "Senior",
    "Include this response?": "yes",
    "Career Filter": "Business/Finance || Engineering/Tech",
    "Major Filter": "Engineering/Math",
    "What is your Major(s) and Minor(s)?": "Mathematics and Computer Science (double major)",
    "Post Grad Plans": "Equity Derivatives Trader at Goldman Sachs",
    "Previous experiences and career path": "SWE internship at startup H2O.ai, sales and trading internship at HSBC, sales and trading internship at Goldman Sachs",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "Talk to more people about their jobs (i.e. networking), invest in the stock market, read WSJ, play poker",
    "Skills to focus on": "invest in markets, read WSJ, play poker, sports betting, prediction markets",
    "Hacks and shortcuts": "knowing people >>",
    "Networking strategies": "always ask whomever you're talking to if they'd recommend speaking with anyone else, so that each contact leads to more",
    "Additional advice": ""
  },
  {
    "Timestamp": "4/21/2025 17:50:02",
    "What is your Uni": "ijc2119",
    "Year": "Senior",
    "Include this response?": "yes",
    "Career Filter": "Business/Finance || Engineering/Tech",
    "Major Filter": "Engineering/Math",
    "What is your Major(s) and Minor(s)?": "Data Science Major, EALAC Minor",
    "Post Grad Plans": "Data Analyst",
    "Previous experiences and career path": "I came into college planning to study chemistry but realized that that wasn't the path for me. I switched majors in my freshman year and went head first into a field I knew nothing about. Along the way, I did a research program and an internship which were both related to my new field of study. I did a few clubs, but they weren't related to my major.",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "Be more involved with clubs, classes, and my major. Investigate and be inquisitive about the opportunities that the school has in place for us. But honestly it isn't that serious and you should enjoy life in your first couple years of school",
    "Skills to focus on": "Getting hands on experience-- whether it be in classes, clubs, or just by yourself, having experience you can directly cite that demonstrate your skillset is most important. Don't sweat it if your grades aren't perfect; they don't matter than much. Also, be a nice person to work with. those types of soft skills will take you a lot further than you think. Lastly, figure out your strengths and how you can play to them.",
    "Hacks and shortcuts": "There aren’t really shortcuts. Just stay consistent with your goals. Personal projects and learning outside of class can really build your skills. Most importantly, don’t let rejections or setbacks discourage you.",
    "Networking strategies": "Don’t be afraid to reach out to someone if you’re curious about their work or have questions. The worst that can happen is they don’t respond — and that’s not a big deal in the long run.",
    "Additional advice": "don't be afraid to be a little cocky-- you want to present your best self and having an air of confidence about you can make those around you believe that you really are all that. also truly it is underrated to just be a good person to work with. not everyone can be cracked but you can try to be a friendly, dependable person and that will take you very far in terms of getting you connections, referrals, recommendations, etc. Also really reflect on your skills and communicate them/advocate for yourself actively."
  },
  {
    "Timestamp": "4/21/2025 18:22:05",
    "What is your Uni": "mpf2137",
    "Year": "Senior",
    "Include this response?": "yes(shitty)",
    "Career Filter": "Business/Finance || Engineering/Tech",
    "Major Filter": "Business/Finance",
    "What is your Major(s) and Minor(s)?": "Financial Economics",
    "Post Grad Plans": "Equity Derivatives at Morgan Stanley",
    "Previous experiences and career path": "Freshmen year: finance internship at a tech company. Sophomore: Sales and Trading internship at JPMorgan. Junior Year: IB at Morgan Stanley.",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "Nothing. I would have told myself to not stress too much, but start as early as possible.",
    "Skills to focus on": "Technical skills and networking.",
    "Hacks and shortcuts": "Work Smart not Hard",
    "Networking strategies": "Go to DEI programs.",
    "Additional advice": ""
  },
  {
    "Timestamp": "4/21/2025 18:52:02",
    "What is your Uni": "aab2295",
    "Year": "Senior",
    "Include this response?": "yes",
    "Career Filter": "Government/Policy/Legal || Education/Teaching",
    "Major Filter": "Social Sciences",
    "What is your Major(s) and Minor(s)?": "Anthropology",
    "Post Grad Plans": "Fulbright or Peace Corps. Law school later.",
    "Previous experiences and career path": "summer 1: summer camp job. Summer 2 and 3: intern at immigration law firm",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "Don't make all your decisions based on what you want as a career. Take time to explore and LEARN. This university has so much knowledge and personal growth to offer -- it's a shame to waste that worrying so much about the future. Take this opportunity grow intellectually and expand your worldview. Shop as many classes as possible and take classes that genuinely interest you. Join clubs and extracurriculars because you want to, not because you feel like you should for your career. Go to office hours and form relationships with professors -- they always excited to help",
    "Skills to focus on": "Reading, thinking, talking to professors, engaging in campus organizing, making friends, having fun, exploring the city, volunteering, etc",
    "Hacks and shortcuts": "to get my internships I cold emailed a bunch of law firms and the one that was the most understaffed hired me",
    "Networking strategies": "Just make real friends and find real mentors lol. Focus on genuine relationships",
    "Additional advice": "The careerism at this institution is crippling, don't get too caught up in it."
  },
  {
    "Timestamp": "4/22/2025 9:42:31",
    "What is your Uni": "sar2262",
    "Year": "Senior",
    "Include this response?": "yes",
    "Career Filter": "Business/Finance || Government/Policy/Legal",
    "Major Filter": "Business/Finance",
    "What is your Major(s) and Minor(s)?": "Financial Economics (Major) and Sustainable Development (Minor)",
    "Post Grad Plans": "Analyst/Paralegal in the Shareholder Activism and Corporate Defense Practice at Sidley Austin",
    "Previous experiences and career path": "Clubs: My longest club engagements were with the Columbia Undergraduate Law Review, Lion Fund, Columbia Hindu Students Organization, and Columbia Sur (a cappella). I'm also involved with intramural basketball!\n\nResearch: During sophomore year, I started research at the Columbia Center on Sustainable Investment, a joint initiative of Columbia Law School and Columbia Climate School. My junior year, I assisted with corporate governance research for a professor at Columbia Law School. Over the last year, I have been conducting research as a Fellow with the Climate Knowledge Initiative at Columbia Business School.\n\nInternships: Did investment work at TortoiseEcofin (an energy transition-focused asset management firm in my home town), ESG work at Paul Weiss, and Sustainable & Transition Solutions at BlackRock.\n\nOther involvements: I've loved serving as a Teaching Assistant in Principles of Economics for 2 years (4 semesters), and have also been teaching financial literacy at a local high school for 3 years.",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "I would have talked to more people about diverse and nontraditional career paths. I also would have visited more Office Hours with my professors.",
    "Skills to focus on": "Familiarity with Excel and PowerPoint, staying up-to-date with the news, clear analytical writing, and generally having a tendency to voraciously consuming knowledge",
    "Hacks and shortcuts": "Be open to taking calculated and serendipitous risks! It's easy to be overwhelmed by imposter syndrome. You have so much to offer as long as you advocate for yourself and have mentors or professors in your corner. Talk to everyone, and treat them with kindness, dignity, and respect -- it will benefit you tenfold in the long-run.",
    "Networking strategies": "Reach out to Columbia alum and people in a few grades above you who have had interesting experiences so that you can have a balanced view of what a short and long-term career looks like. Seek commonalities with the person you are emailing, and remember that cold emailing is a numbers game that ultimately works in your favor.",
    "Additional advice": "A Columbia senior once told me to prioritize 8 hours of sleep over all-nighters because the work always gets done. Three years later, I still tend to agree with that."
  },
  {
    "Timestamp": "4/22/2025 14:15:25",
    "What is your Uni": "pjm2188",
    "Year": "Senior",
    "Include this response?": "yes",
    "Career Filter": "Engineering/Tech || Media/Arts/Museums",
    "Major Filter": "Engineering/Math",
    "What is your Major(s) and Minor(s)?": "Computer Science-Mathematics",
    "Post Grad Plans": "Pursuing an MS in Computer Science at Columbia University before starting a career as a software engineer.",
    "Previous experiences and career path": "Entered Columbia as an astrophysics major, planned to pursue a PhD and go into academia, or work as a research scientist at a lab. After two summers of research, I found myself dissatisfied with the work I was doing, and decided that research wasn't for me. I realized how important and prevalent programming is in research and industry, so I ended up switch to Computer Science-Mathematics.",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "I would have researched more into the different career paths. I had never heard of IB, consulting, and I didn't really know much of anything about software engineering. I would have tried to better prepare myself from the start, and I would have majored in computer science.",
    "Skills to focus on": "Practice leetcode so you are better prepared for interviews, but more importantly spend time outside of class working on projects that you enjoy. Creating an app or website is a good display of passion and skill, and it really increases your chances of landing a job.",
    "Hacks and shortcuts": "Networking with other people by forming relationships with peers and alumni.",
    "Networking strategies": "Reaching out on LinkedIn works a lot of the time, or meeting someone in the industry through a mutual friend.",
    "Additional advice": "It's better to invest the time in figuring out what you want to do early, it'll make your live easier later."
  },
  {
    "Timestamp": "4/22/2025 14:59:29",
    "What is your Uni": "ffd2107",
    "Year": "Senior",
    "Include this response?": "yes",
    "Career Filter": "Government/Policy/Legal || Media/Arts/Museums",
    "Major Filter": "Social Sciences",
    "What is your Major(s) and Minor(s)?": "American Studies & German",
    "Post Grad Plans": "Working as a Legal Research Associate for a New York State Assemblyman, focusing on legal issues and starting a career in politics",
    "Previous experiences and career path": "I came in to Columbia with almost no career experience. I spent my first summer studying abroad in Berlin, doing art and music hum and Freie Universität Berlin. I was working a work study job in costuming during the school years, as well as doing gig bartending on the side. My \"big break,\" as it were, came from a chance meeting during a research fellowship that I got sophomore year. I was working on Rye, NY local history, focusing on Native people and early treaties, and the ex-mayor of Rye came to my final presentation, and was so impressed with my work that he offered to higher me for his office. I then began working for him part time. I prepared for this position through previous campaign work I had done in high school, as well as political classes I had been taking. But I had no formal transition process, or \"ladder climbing.\" Because of this job, I was able to study abroad junior year as well, rather than trying to find a research position or an internship.",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "Honestly, I would have worried about it less. I spent so much time applying to internships (over 60 applications in Sophomore year, only 3 responses, and no jobs from any of them), and I could have better used that time to focus on my academics and extra curriculars. The idea that you need to have an internship or fellowship freshman year is insane, and I think students loose sight of the idea that no one expects a 19 year old to have two years of experience in their field. Try new things, experiment, and the rest will come.",
    "Skills to focus on": "Stay up to date with politics! So much of my job is reacting to the news, and being ready to have conversations is a must. Brief writing is a great skill, a familarity with the law is super helpful. I try to surround myself with people more invested that I am, to see what they find interesting.",
    "Hacks and shortcuts": "Don't wait until you're working in a specific field to familarize yourself with the field. Subscribe to a couple newsletters (Politico is the gold standard) and keep up to date. Take classes you are genuinely interested in, so you are passionate about doing the work in your free time. Have business cards with your name, email, and any other relevant information (these are HUGE in the political world).",
    "Networking strategies": "The Columbia Alumni Mentorship program is amazing, I found all of my mentors super helpful, and I sign up for it every semester. I like the Columbia networking events, but you actually have to go out of your way to talk to people.",
    "Additional advice": "Don't freak out is the best advice on almost every issue that I can give. Seriously, don't. Everything I spent time worrying about always ended up ok, not because of luck, but because I decided to stop worrying and start doing something about it."
  },
  {
    "Timestamp": "4/22/2025 15:20:23",
    "What is your Uni": "bws2127",
    "Year": "Senior",
    "Include this response?": "yes",
    "Career Filter": "Engineering/Tech || Academia/Graduate School",
    "Major Filter": "Engineering/Math",
    "What is your Major(s) and Minor(s)?": "Chemical Engineering with a Minor in Materials Science",
    "Post Grad Plans": "Pursuing a PhD in Chemical Engineering at the University of Michigan.",
    "Previous experiences and career path": "I didn't work during my freshman or sophomore school years. I worked the summers in the trades (tree work). In the middle of my Junior Year (Jan) I started working in a research lab in the chemical engineering department. I then completed an internship that summer. I have continued working in that lab since then. I have done lots of side projects that I initiate with professors I really get along with. These projects range from a couple weeks to a year long. This initiative and focus helped a lot in grad school applications, as I had some basic understanding of my topics of interest, and I had clear signs of interest. I am very active and participate in some athletic clubs, but none of the social or academic clubs.",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "I would've started looking for what I liked a lot earlier by talking and interacting with more people and papers. I would've liked to have learned how to skim papers and learn about fields and current thrusts earlier. Also, try out multiple research labs,, but be courteous and up front. \n\nIn terms of reaching out, I would have liked to have gone to a lot more talks. I go to them quite often now, and they are great opportunities to expand your horizons and meet people. In my field at least, people are very excited to talk about their research. \n\nThe departments are often hosting lots of talks, ask your professors or department managers for upcoming events.",
    "Skills to focus on": "ChemE is very different in industry vs. research, and I don't have much industry experience. But for research, I would focus on reading papers and system level thinking. \n\nThe ability to read narratives and stories from the equations and figures of a paper is crucial. Also, ask your professors and other people about their tactics for reading large amounts of papers, or how they sift through research papers, they all have some strategy. Try some out. \n\nSystem level thinking is also important. Learn how to re -parameterize your problems and projects into systems with clear responses to impulses. If you can learn basics from research papers and think about the general systems that people are working on, you can strike up lots of conversations where you will learn a lot. \n\nIn terms of technical skills, take a statistical mechanics or electronic properties of materials class. And focus on your math, it's key for everything. Lots of ChemE depends on this stuff, and for research its great to know the forces at play in your system. Granted this does depend on the length scales you work at.",
    "Hacks and shortcuts": "Going to talks and reaching out to professors and other professionals. Going to talks lets you see how the fundamentals you are learning are being applied. It gives a great idea of what things are important and the areas of work available. Also, Columbia hosts lots of really good people, take advantage of it. \n\nAlso, talking to professors about their research is normally a good way to get involved and learn about the field. If you want to go to grad school, do your best to try to go to a conference. Join the AIChE club, or have good research to present at a conference. The conferences are a really great opportunity to meet people. Go up to people, and also work to try and see them a second time to make your initiative clear. \n\nAgain, I have very little industry experience. I got my job through a boss I had worked for in the past.",
    "Networking strategies": "The best strategies for me have been conferences and talks. I try as much as possible to meet and interact with people face to face. The conferences and talks provide a great opportunity to get your name in someone's head, and they are much more likely to meet or help you afterwards.",
    "Additional advice": "It will work out the way it is supposed to. You will find mentors that are the right fit for you. If you work hard to reach out and meet people, you will find a good fit and this can make all the difference. But also, lots of the time it won't work out. Some talks are not for you, and some speakers don't want to talk. Keep putting yourself out there and meeting people, and you will end up with the right fit. Also, don't take rejections for conversations or working in a lab personally, you will end up where you will be the most impactful and happiest. \n\nFinally, try lots of things out. You might think you like one part of ChemE or engineering, but the fields are super broad. Talk to people from all corners of the disciple, and try out as many types as you can. You will find something that suits you. But if you don't, that's also fine, because there's lots of other people and types of research or jobs out there."
  },
  {
    "Timestamp": "4/23/2025 7:17:21",
    "What is your Uni": "zh2500",
    "Year": "Senior",
    "Include this response?": "yes",
    "Career Filter": "Engineering/Tech",
    "Major Filter": "Engineering/Math",
    "What is your Major(s) and Minor(s)?": "Chemical Engineering major, applied math minor",
    "Post Grad Plans": "Engineer at Form Energy.",
    "Previous experiences and career path": "research freshman summer + part time for rest of time at columbia, internship at NYU research lab sophomore summer, internship at start up junior summer, part time/remote for start up senior spring",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "talked to upperclassmen",
    "Skills to focus on": "computer science, lots of interviews to get better and better at them",
    "Hacks and shortcuts": "making connections by joining a research lab. Allowed me to get my foot in the door and show work experience while in school",
    "Networking strategies": "I havent really \"networked\" - just working with people and doing a good job, makes them more likely to recommend you and vouch for you",
    "Additional advice": "don't go into finance or consulting or pursue a phd o anything really just because it feels like thats what \"Everyone\" is doing. we all live in different bubbles at Columbia and within bubbles it may be feel like everyone is going into tech but in another everyone is trying to get into grad school or law school. do what you actually want to do"
  },
  {
    "Timestamp": "4/25/2025 16:02:14",
    "What is your Uni": "sp4049",
    "Year": "Senior",
    "Include this response?": "yes",
    "Career Filter": "Business/Finance",
    "Major Filter": "Social Sciences",
    "What is your Major(s) and Minor(s)?": "Anthropology & CS",
    "Post Grad Plans": "Consulting, Associate",
    "Previous experiences and career path": "Freshmen summer: CS research, remote startup internship\nSophomore summer: digital marketing internship in nyc\nJunior spring: business development & engineering internship with early stage startup\nJunior summer: customer support internship with fintech company",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "- start exploring early-career programs with big tech\n- speak more to upper classman about their paths\n- enjoy the city! while you still have time to explore",
    "Skills to focus on": "- keep up with news\n- inter-personal communication skills, be conscious of how you engage with people\n- start getting to know what are your strength, what you are good at",
    "Hacks and shortcuts": "- alum who share similar backgrounds\n- CCE advisor who became very good mentor, very helpful when making decisions and negotiating offers",
    "Networking strategies": "- alum mentors introduce me to their friends who work in areas I'm interested in\n- linkedIn reach out",
    "Additional advice": ""
  },
  {
    "Timestamp": "5/5/2025 20:15:27",
    "What is your Uni": "pjm2187",
    "Year": "Senior",
    "Include this response?": "yes",
    "Career Filter": "Other",
    "Major Filter": "Science/Health Science",
    "What is your Major(s) and Minor(s)?": "Environmental Science (pre-med for veterinary school)",
    "Post Grad Plans": "Vetinary assistant",
    "Previous experiences and career path": "I have interned at a wildlife rehabilitation hospital, was a veterinary assistant at a pet hospital, researched at LDEO at Columbia, took summer classes, and was the captain of the Columbia ski and snowboard team.",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "I probably would have started taking pre-med classes earlier. I originally came to Columbia not knowing I wanted to go into veterinary medicine. However, that is all part of the process of learning what you want to do over your time at college.",
    "Skills to focus on": "Managing your stress levels! It is important to know yourself and also realize everything works out the way it is supposed to. Try not to put so much pressure on grades and yourself. I found that to be one of my difficulties especially freshman year. I learned that not everything is as serious as you may think. A bad grade is not the end of the world and you will definitely get them on exams during your time at Columbia.",
    "Hacks and shortcuts": "Networking is important. Just reach out!",
    "Networking strategies": "Talking to anyone and everyone in your field that you meet and seeing if they have any advice or opportunities. Once you get a job or position... lean on them. Reach out to them again the next time you are looking for a position to see if they have any openings or any connections to other places in your field.",
    "Additional advice": "You've got this. It can be extremely tough sometimes, but you will get through it, I promise. I struggled a lot the first years of college and I have grown a lot from those struggles as well. I appreciate my time here especially now looking back on it. It is not always easy to appreciate everything in the moment, but do your best to keep things in perspective and really enjoy NYC!"
  },
  {
    "Timestamp": "5/25/2025 0:49:27",
    "What is your Uni": "Egs2172",
    "Year": "Senior",
    "Include this response?": "yes",
    "Career Filter": "Engineering/Tech",
    "Major Filter": "Engineering/Math",
    "What is your Major(s) and Minor(s)?": "Electrical Engineering",
    "Post Grad Plans": "HVDC Engineer for National Grid Ventures, working to develop and design transmission",
    "Previous experiences and career path": "For summer internships, I have worked as an assistant in a solar cell lab, in an engineering consulting group, and for a utility. I've also been part of fsae.",
    "What would you have done differently as a freshman or sophomore to better prepare for your career?": "Don't care about grades, join a club or research group where you can learn technical skills and throw yourself into a community.\nAlso, connect with profs by going to office hours.",
    "Skills to focus on": "Do projects to learn hands on engineering skills and build confidence in your problem solving skills.",
    "Hacks and shortcuts": "Keep a spreadsheet of your network! LinkedIn isn't enough",
    "Networking strategies": "Networking is actually so important! I thought engineering was a meritocracy, and that networking didn't matter as much but I was very wrong about this. Most of my blind applications for jobs went unanswered, even for roles I was very qualified for. But for jobs that I had even the loosest connection to, employers bent over backwards.",
    "Additional advice": "Be engaged! Take advantage of resources! Carpe Diem! And care less about grades!"
  }

  
]